##########################################
#################通用设置#################
##########################################
#超分倍率
scale=2
#参数路径，可更换
#降噪版(denoise)：如果原片噪声多，压得烂，推荐使用；目前2倍模型支持了3个降噪等级；
#无降噪版(no-denoise)：如果原片噪声不多，压得还行，但是想提高分辨率/清晰度/做通用性的增强、修复处理，推荐使用；
#保守版(conservative)：如果你担心丢失纹理，担心画风被改变，担心颜色被增强，总之就是各种担心AI会留下浓重的处理痕迹，推荐使用该版本。
model_path2 = "weights_v3/up2x-latest-denoise3x.pth"
model_path3 = "weights_v3/up3x-latest-denoise3x.pth"
model_path4 = "weights_v3/up4x-latest-denoise3x.pth"
#half:早期显卡开半精度不会提速，但是开半精度可以省显存；>=20系N卡无脑选True即可
half=True
#tile越大，越省显存，速度越慢
tile=5
#cache_mode:如果显存在爆炸的边界，还可以挣扎，选0或1(都是无损)，1比0耗时增长15%，更省显存；如果显存显然无法挣扎（比如只有2G显存想超>=720P,或者输入超大分辨率的图（例如4K）），选2或3；2耗时+25%，仅在有景深虚化的图里增加5%误差；3耗时增加150%但无损
cache_mode=1
#alpha越大AI修复程度、痕迹越小，越模糊；alpha越小处理越烈，越锐化，色偏（对比度、饱和度增强）越大
# #可调区间：(0.75,1.3)，默认为1不调整
alpha=1
#超分模式，视频or图像文件夹
mode="image"#video#image
############################################
#################超图像设置#################
############################################
#0代表卡号，多卡的话可以写不同config并行开，显存多利用率打不满的话一张卡也可以开多个
#如果要用CPU跑，""里填cpu
device="cuda:0"
input_dir="input_dir1"#输入图像路径
output_dir="output_dir"#超分图像输出路径
############################################
#################超视频设置#################

inp_path=r"C:\Users\liujing\Desktop\Z\input.mov"
opt_path=r"C:\Users\liujing\Desktop\Z\output.mp4"
#线程数：量力而行，填小了利用率低，填大了爆显存
nt=2
#显卡数
n_gpu=1
#别乱动
p_sleep=(0.005,0.012)
decode_sleep=0.002
#编码参数，不懂别乱动;通俗来讲，crf变低=高码率高质量，slower=低编码速度高质量+更吃CPU，CPU不够应该调低级别，比如slow，medium，fast，faster
encode_params=['-crf', '21', '-preset', 'medium']
